In [1]:
# Import NumPy package for use
import numpy as np
# Import Pandas package for use
import pandas as pd

In [2]:
# Create a numberic list
values = [10,20,30]    # numeric list contains 10,20,30
A = pd.Series(values)  # create a series based on numeric list
A  # show series

0    10
1    20
2    30
dtype: int64

In [3]:
# Create a string list for labels
labels = ['First','Second','Third']
B = pd.Series(values,labels)  # create a series based on numeric list and labels
B   # show series

First     10
Second    20
Third     30
dtype: int64

In [4]:
# Create a numpy array
array = np.arange(10, 31, 10)  # numpy array
array  # show array

array([10, 20, 30])

In [5]:
# Create a series based on array and labels
C = pd.Series(array,labels)
C   # show series

First     10
Second    20
Third     30
dtype: int32

In [6]:
# Create a Pyton dictionary
dic = {'First':10,'Second':20,"Third":30}   # Python dictionary contains 3 key-value pairs
dic  # show dictionary

{'First': 10, 'Second': 20, 'Third': 30}

In [7]:
# Create a series based on dictionary
D = pd.Series(dic)
D   # show series

First     10
Second    20
Third     30
dtype: int64

In [8]:
# Create a series by switching the labels and values
E = pd.Series(labels,values)
E  # show series

10     First
20    Second
30     Third
dtype: object

In [2]:
# Create a series of WWII countries with numeric labels
countries = pd.Series([1,2,3,4], ['USA','Britain','France','Germany'])
countries   # show series

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [11]:
# Grab the first element
countries['USA']    # first label index

1

In [15]:
# Create a series of WWII countries with string labels
countries2 = pd.Series(['USA','Britain','France','Germany'],[1,2,3,4])
countries2  # show series

1        USA
2    Britain
3     France
4    Germany
dtype: object

In [16]:
# Grab the first element
countries2[1]     # first numeric index

'USA'

In [17]:
# Add the same series
double_countries = countries + countries   # add countries with countries
double_countries

USA        2
Britain    4
France     6
Germany    8
dtype: int64

In [4]:
# Create another series of WWII countires with numeric labels
countries3 = pd.Series([1,5,3,4],['USA','USSS','France','Germany'])
countries3  # show series

USA        1
USSS       5
France     3
Germany    4
dtype: int64

In [19]:
# Add the different series
mixed_countries = countries + countries3
mixed_countries   # show series

Britain    NaN
France     6.0
Germany    8.0
USA        2.0
USSS       NaN
dtype: float64

In [20]:
# Add the mixed series which have no labels match and data points are of different types
funny_countries = countries + countries2
funny_countries

1          NaN
2          NaN
3          NaN
4          NaN
Britain    NaN
France     NaN
Germany    NaN
USA        NaN
dtype: object

In [3]:
# Create a data frame with one series
df = pd.DataFrame([countries])  # pass a series in a list
df   # show data frame

   USA  Britain  France  Germany
0    1        2       3        4

In [10]:
# Create a new series 
countries4 = pd.Series([5,1,3,4], ['USA','Britain','France','Germany'])
countries4  # show series

USA        5
Britain    1
France     3
Germany    4
dtype: int64

In [13]:
# Create an index
index = 'WWI WWII'.split()   # Use split() method to create a list
index    # show list

['WWI', 'WWII']

In [14]:
# Create a data frame with two series and index
new_df = pd.DataFrame([countries, countries4], index)   # pass two series and index
new_df    # show data frame

      USA  Britain  France  Germany
WWI     1        2       3        4
WWII    5        1       3        4

In [15]:
# Use split() method to split an email into the username and domain name
email = 'Jason@gmail.com'
string_list = email.split('@')
string_list   # show list

['Jason', 'gmail.com']

In [17]:
# Create an array
my_array = np.arange(1,21).reshape(5, 4)  # Create an array with the element from 1 to 20 in 5 rows and 4 columns
my_array   # show array

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [18]:
# Create row labels
row_labels = 'A B C D E'.split()   
row_labels   # show labels

['A', 'B', 'C', 'D', 'E']

In [24]:
# Create column labels
col_labels = 'odd1 even1 odd2 even2'.split()
col_labels   # show labels

['odd1', 'even1', 'odd2', 'even2']

In [25]:
# Create a data frame with array, row and columns labels
df_array = pd.DataFrame(my_array,row_labels,col_labels)
df_array

   odd1  even1  odd2  even2
A     1      2     3      4
B     5      6     7      8
C     9     10    11     12
D    13     14    15     16
E    17     18    19     20

In [21]:
# Grab one column from the above data frame
df_array['odd1']

A     1
B     5
C     9
D    13
E    17
Name: odd1, dtype: int32

In [22]:
# Verify the output is a Pandas series
type(df_array['odd1'])

pandas.core.series.Series

In [26]:
# Grab two columns from the above data frame
df_array[['odd1','even2']]

   odd1  even2
A     1      4
B     5      8
C     9     12
D    13     16
E    17     20

In [27]:
# Grab a specific element from the above data frame
df_array['odd2']['D']   # select the value 15

15

In [28]:
# Grab the row E using .loc() method from the above data frame
df_array.loc['E']

odd1     17
even1    18
odd2     19
even2    20
Name: E, dtype: int32

In [29]:
# Grab the row E using .iloc() method from the above data frame
df_array.iloc[4]

odd1     17
even1    18
odd2     19
even2    20
Name: E, dtype: int32

In [30]:
# Grab single item using .loc() method
df_array.loc['E']['even2']  # select the value 20

20

In [32]:
# Grab single item using .iloc() method
df_array.iloc[4]['even2']  # select the value 20

20